# Произвольная программа

# Напишите программу, которая создает список из произвольных элементов, выводит длину списка, а затем первый и последний элемент списка.

# Напишите тут ваш код

res = [1,2.2,'3',(4,5),'Stop']
print(len(res))
print(res[0])
print(res[-1])