# Сортировка.

# Напишите программу, которая использует лямбда-функцию для сортировки списка строк по их длине
# с использованием функции sorted(). Программа должна:
# Создать список строк.
# Использовать sorted() и лямбда-функцию для сортировки строк по длине.
# Вывести результат.

# Напишите тут ваш код

s1 = ['one','two','three','four'] 
s2 = sorted(s1,key=lambda x: len(x))
print(s2)