# Двоичное представление

# Напишите программу, которая принимает целое число от пользователя,
# преобразует его в двоичное представление и показывает, как оно будет храниться в памяти.
# В программе также должно быть отображено количество байтов, занимаемое числом.

# Напишите тут ваш код

user_num = int(input())
print(f"{user_num:b}")
print(user_num//2)