# Генератор квадратов

# Напишите программу, которая создает список квадратов чисел от 1 до 10 с использованием List Comprehension.
# Программа должна вывести полученный список.

# Напишите тут ваш код

ls = [(i+1)**2 for i in range(10)]
print(ls)