# Распаковка

# Напишите программу, которая создает кортеж из 3 элементов (например, имя, возраст, город).
# Затем программа должна распаковать кортеж в отдельные переменные и вывести каждую переменную.

# Напишите тут ваш код
t1=('Pol',44,'Brno')

p1,p2,p3=t1

print(p1)
print(p2)
print(p3)