# Просто и сложно одновременно

# Создай 5 кортежей с разной длинной: 0 элементов, 1 элемент, 5 элементов, 100 элементов, 1000 элементов.
# Выведи их на экран.

# Напишите тут ваш код
k1=()
k2=(1,)
k3=(1,2,3,4,5)
k4=tuple([i for i in range(100)])
k5=tuple([i for i in range(1000)])

print(k1)
print(k2)
print(k3)
print(k4)
print(k5)