# Ошибка с отступами.

# Напиши программу, которая создает исключение IndentationError

# Напишите тут ваш код

def fun():
print("1")

fun()