# Многострочность.

# Напишите программу, которая создает и выводит на экран строки, объявленные различными способами:
# Строку с использованием одинарных кавычек.
# Строку с использованием двойных кавычек.
# Многострочную строку с использованием тройных кавычек.

# Напишите тут ваш код

st1 = 'One string'
st2 = "Two string"
st3 = """thre string.This is a long quote that contains multiple types of quotation marks,
This is a long quote that contains multiple types of quotation marks,
This is a long quote that contains multiple types of quotation marks"""

print(st1)
print(st2)
print(st3)