# Срезы

# Напишите программу, которая создает список из 10 элементов,
# выводит элементы с третьего по седьмой включительно с использованием срезов
# и выводит последние три элемента списка с использованием отрицательных индексов.

# Напишите тут ваш код
tmp=list(range(10))

print(tmp[2:7])
print(tmp[-3:])