# Запаковка

# Напиши программу, которая содержит словарь, который содержит список, который содержит словарь, который содержит список, который содержит строку.

# Напишите тут ваш код

sl1={"nm1":[1,{'p1':[9,110,"12"]},3,4,5],"nm2":[2,3,4]}
print(sl1)