# F-нотация

# Напишите программу, которая запрашивает у пользователя его имя, возраст и город.
# Затем используйте f-нотацию, чтобы вывести сообщение в следующем формате: "Привет, {имя}! Тебе {возраст} лет, и ты живешь в городе {город}."

# Напишите тут ваш код
name_ = input("Enter your name: ")
age_ = input("Enter your age: ")
city_ = input("Enter your city: ")

print(f"Привет, {name_}! Тебе {age_} лет, и ты живешь в городе {city_}.")