# Все не так однозначно.

# Напиши программу, которая делит целое число на целое.
# Выведи на экран тип результата.

# Напишите тут ваш код
num1 = 5
num2 = 3
res = num1/num2
res_type=type(res)

print(res_type)