# Семицветик

# Напишите программу, которая создает множество из 7 элементов - названий цветов (color).
# Программа должна вывести все элементы созданного множества на экран.

# Напишите тут ваш код
semi = {'красный','оранжевый','желтый',
'зеленый','голубой','синий','фиолетовый'}

print(*list(semi))