# Экранирование

# Напишите программу, которая создает и выводит на экран строки:
# Строку с вложенными кавычками с использованием разных типов кавычек.
# Строку с вложенными кавычками с использованием экранирования.

# Напишите тут ваш код

st1 = "one string 'no one!'"
st2 = "two string \"no one\""
print(st1)
print(st2)