# Математика 8 класса

# Напишите программу, которая запрашивает у пользователя число и использует библиотеку math для вычисления и вывода квадратного корня и факториала этого числа.

# Напишите тут ваш код
import math 

int_ = int(input("Enter number: "))
sqrt_ = math.sqrt(int_)
fact_ = math.factorial(int_)

print(sqrt_)
print(fact_)