# Стиратель

# Напишите программу, которая создает список из 10 элементов, затем заменяет элементы с третьего по пятый на одно значение, запрашиваемое у пользователя.
# Программа должна вывести обновленный список.

# Напишите тут ваш код

sp=[1,2,3,4,5,6,7,8,9,10]
elem=input()
sp[2:5]=elem



print(sp)