# Деление на ноль.

# Напиши программу, которая создает исключение ZeroDivisionError

# Напишите тут ваш код
def func_c():
    print(1 / 0)
    
func_c()