# Негатив

# Напишите программу, которая запрашивает у пользователя число и проверяет, является ли оно отрицательным.
# Используйте оператор if для проверки.

# Напишите тут ваш код
num_=int(input("Enter your number: "))

if num_ >=0:
    print('Non negative number')
else:
    print('Negative number')