# Случайный середнячек

# Напишите программу, которая генерирует 10 случайных чисел в диапазоне от 1 до 100, используя библиотеку random.
# Затем подсчитайте их среднее значение и выведите его на экран.

# Напишите тут ваш код
import random

res = 0
for _ in range(10)
    rnd_ =random.randint(1,100) 
    res += rnd_
    
print(res/10)
