# Мой любимый список

# Напишите программу, которая создает динамический массив (список)
# и демонстрирует его основные операции: добавление, удаление, доступ по индексу и изменение элемента.
# Класс list использовать можно.

# Напишите тут ваш код

lst_ = []
lst_.append(0)
lst_.append(1)
lst_.append(2)

print(lst_)
print(lst_[1])
lst_.pop()
print(lst_)
lst_[-1] = 100
print(lst_)